---
kind: type
id: T:Autodesk.Revit.DB.Visual.AdvancedTransparent
source: html/123a1d0d-0c2f-b510-fe5e-e4db5f247f27.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent

A static class that provides access to the property names that appear in the AdvancedTransparent visual asset schema.

## Syntax (C#)
```csharp
public static class AdvancedTransparent
```